tap "daipeihust/tap"
tap "homebrew/bundle"
tap "jesseduffield/lazygit"
brew "base64"
brew "cmake"
brew "fzf"
brew "ghq"
brew "git"
brew "helm"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "luarocks"
brew "openjdk"
brew "maven"
brew "neovim"
brew "ripgrep"
brew "sheldon"
brew "starship"
brew "stern"
brew "tree"
brew "zoxide"
brew "daipeihust/tap/im-select"
brew "jesseduffield/lazygit/lazygit"
cask "dbeaver-community"
cask "font-hack-nerd-font"
cask "hammerspoon"
cask "iterm2"
cask "karabiner-elements"
cask "raycast"
cask "visual-studio-code"
cask "wezterm"
vscode "artdiniz.quitcontrol-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "mujichok.vscode-project-name-in-statusbar"
vscode "sumneko.lua"
