tap "daipeihust/tap"
tap "homebrew/bundle"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "koyeb/tap"
tap "nikitabobko/tap"
tap "xwmx/taps"
brew "arp-scan"
brew "awscli"
brew "base64"
brew "glib"
brew "cairo"
brew "cmake"
brew "curl"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "git-delta"
brew "go"
brew "go-task"
brew "harfbuzz"
brew "helm"
brew "hugo"
brew "jq"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "lazygit"
brew "libzip"
brew "lua"
brew "luarocks"
brew "openjdk"
brew "maven"
brew "mkcert"
brew "mysql-client"
brew "neovim"
brew "podman-compose"
brew "rbenv"
brew "ripgrep"
brew "sheldon"
brew "starship"
brew "stern"
brew "t-rec"
brew "tldr"
brew "tree"
brew "zoxide"
brew "daipeihust/tap/im-select"
brew "jesseduffield/lazydocker/lazydocker"
brew "koyeb/tap/koyeb"
cask "dbeaver-community"
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "hammerspoon"
cask "karabiner-elements"
cask "podman-desktop"
cask "raycast"
cask "swift-shift"
cask "visual-studio-code"
cask "wezterm@nightly"
vscode "anthropic.claude-code"
vscode "arjun.swagger-viewer"
vscode "asciidoctor.asciidoctor-vscode"
vscode "bierner.markdown-mermaid"
vscode "docker.docker"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "leetcode.vscode-leetcode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "shopify.ruby-lsp"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
